---
kind: property
id: P:Autodesk.Revit.DB.ElementId.InvalidElementId
source: html/08ae8886-6ab3-3ef5-d2e0-0da2ffa7bd2c.htm
---
# Autodesk.Revit.DB.ElementId.InvalidElementId Property

Get the invalid ElementId whose value is -1.

## Syntax (C#)
```csharp
public static ElementId InvalidElementId { get; }
```